app/Controllers/Api/MoyenController.php

SELECT *
FROM "moyen"
---
    public function index()
    {
        $moyenModel = new MoyenModel();
        return $this->response->setJSON($moyenModel->findAll());