app/Controllers/AuthController.php

    public function login()
    {
        $session = session();
        $model = new UtilisateurModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM "utilisateur"
WHERE "email" = 'user@taxibe.mg'
 LIMIT 1