app/Models/FraisModel.php

SELECT *
FROM "frais"
 LIMIT 1
---
    public function getMontantActuel(): float
    {
        $row = $this->first();