app/Models/TrajetModel.php

    public function getAllWithBus(): array
    {
        return $this->select('trajet.*, bus.nom AS nom_bus')
                    ->join('bus', 'bus.id = trajet.id_bus')
                    ->orderBy('bus.nom', 'ASC')
                    ->findAll();
---
SELECT "trajet".*, "bus"."nom" AS "nom_bus"
FROM "trajet"
JOIN "bus" ON "bus"."id" = "trajet"."id_bus"
ORDER BY "bus"."nom" ASC

    public function getWithArrets(int $id): ?array
    {
        // Récupération du trajet + bus
        $trajet = $this->select('trajet.*, bus.nom AS nom_bus')
                        ->join('bus', 'bus.id = trajet.id_bus')
                        ->find($id);
---
SELECT "trajet".*, "bus"."nom" AS "nom_bus"
FROM "trajet"
JOIN "bus" ON "bus"."id" = "trajet"."id_bus"
WHERE "trajet"."id" = 6